
# Assignment 1 -- SQL 1
## Due September 7, 2017, by 11:45 PM.

The goal of this assignment is to write several SQL queries that will answer questions about a set of surgical cases. 
The data is based on the Anaesthetic Shoulder Arthroscopy Cases (ASAC) Dataset from David Cumin. I have made some minor modificiations to the data, so be sure to use the version of the data available on the course Canvas site. If you are interested, you can learn more about the dataset at https://researchspace.auckland.ac.nz/handle/2292/5378. 

There are 6 tables:

1. AN_CASE(ID, LASTNAME, FIRSTNAME, WEIGHT, HEIGHT, SEX, DOB, ASA, OPDATE, PROC) 

2. AN_COMORBID(ID, ICD, DESCR, DETAILS) 

3. AN_DRUGCATEGORY(DRNAME, DRCAT)

4. AN_DRUG(ID, DRNAME, DRTIME, DRVALUE, DRUNIT, DRROUTE, DRCOMMENT)

5. AN_EVENT(ID, EVENTTIME, EVENTDESC)

6. AN_VITALS(ID, SIGNALTIME, SIGNALNAME, VALUE)


1. AN_CASE contains an entry for each surgical case. It includes the patient's name, gender, height and weight. The ASA is the American Society of Anesthesiologist physical status classification, and reflects the patient's ability to tolerate the surgery. DOB is the patient's date of birth and OPDATE is the date the operation happened. PROC describes the procedures performed.

2. AN_COMORBID contains a list of patient conditions, such as smoking or asthma. Patients can have different numbers of comborbidities. Comorbidities are described using an ICD code (ICD-10-CM Diagnosis Code) and a text description. Some conditions include additional information in the DETAILS field.

3. AN_DRUGCATEGORY contains a list of different medications used during the surgical cases and their categories.

4. AN_DRUG contains a list of medications administered during each surgical case along with the details of the administration (dose, time, method, etc.).

5. AN_EVENT contains key events during the surgical case.  Each row includes the case id, time the event occurred and description of the event.

6. AN_VITALS contains the vital sign data (heart rate, systolic and diastolic blood pressure) collected during each case.

### What to turn in
You must turn in your Jupyter Notebook on Canvas.

### Grading
Each query is worth 10 points. Points will be assigned for each query based on the following guidelines:
* 0 points: Query not attempted, query does not give any results, or it does not compile
* 5 points: Query compiles, runs and is most of the way towards a correct answer
* 8 points: The query and answer it produces are almost correct, but there is a slight or subtle bug in the query
* 10 points: The query is correct and gives the right answer

### What's In and Out of Scope

This is intended to be a SQL query assignment. Therefore, you must write queries in SQL (not stored procedures or functions or python code). You may use VIEWs as needed and you may use standard built-in MySQL functions (e.g. ROUND, IF or CASE statements). If you're not sure if something is allowed, ask!

## Acadmic Honesty
The following level of collaboration is allowed on this assignment: You may discuss the assignment with your classmates at a high level. Any issues getting Jupyter Notebooks or MySQL running is totally fine. What is not allowed is direct examination of anyone else's SQL code (on a computer, email, whiteboard, etc.) or allowing anyone else to see your SQL code.  You MAY post and discuss query results with your classmates.

You may use the search engine of your choice to lookup the syntax for SQL commands, but may not use it to find answers to queries.

It does not matter whether or not you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

First, the standard preliminary steps.  For security reasons, don't include your ricedb password.

To run the code, click on it, and press SHIFT+ENTER.

In [4]:
%load_ext sql

In [9]:
%sql mysql+pymysql://ricedb:10271001@localhost/ricedb

'Connected: ricedb@ricedb'

## Preparation

Start fresh, if you need to recreate the tables.

In [10]:
%%sql
DROP TABLE IF EXISTS an_case;
DROP TABLE IF EXISTS an_vitals;
DROP TABLE IF EXISTS an_comorbid;
DROP TABLE IF EXISTS an_event;
DROP TABLE IF EXISTS an_drug;
DROP TABLE IF EXISTS an_drugCategory;

0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

Create the tables you will need for this assignment by excuting the following code:

In [11]:
%%sql
CREATE TABLE an_case (
    id INTEGER,
    lastName varchar(50),
    firstName varchar(50),
    weight FLOAT null,
    height FLOAT null,
    sex CHAR(1),
    dob DATE,
    asa INTEGER,
    ebl INTEGER,
    opDate DATE,
    proc VARCHAR(110)
);

CREATE TABLE an_vitals (
    id INTEGER,
    signaltime INTEGER,
    signalname CHAR(3),
    value FLOAT
);

CREATE TABLE an_comorbid (
    id INTEGER,
    icd VARCHAR(10),
    descr VARCHAR(100),
    details VARCHAR(100)
);


CREATE TABLE an_event (
    id INTEGER,
    eventtime INTEGER,
    eventdescr VARCHAR(100)
);

CREATE TABLE an_drug (
    id INTEGER,
    drname VARCHAR(25),
    drtime INTEGER,
    drvalue FLOAT, 
    drunit VARCHAR(10),
    drroute VARCHAR(50),
    drcomment VARCHAR(100)
);

CREATE TABLE an_drugCategory (
    drname VARCHAR(25),
    drcat VARCHAR(25)
);

0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

Now load the data needed for the assignment. You have to do this in MySQL Workbench. The files are located on the class Canvas site in https://canvas.rice.edu/courses/3600/files/folder/HW1. 

1. Download the files to your computer
2. Update the statements below to point to your file location
3. Execute the statements in MySQL Workbench

LOAD DATA LOCAL INFILE '[your file location]/an_case.txt' 
INTO TABLE an_case fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_vitals.txt' 
INTO TABLE an_vitals fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_comorbid.txt' 
INTO TABLE an_comorbid fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_event.txt' 
INTO TABLE an_event fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_drug.txt' 
INTO TABLE an_drug fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

LOAD DATA LOCAL INFILE '[your file location]/an_drugCategory.txt'
INTO TABLE an_drugCategory fields terminated by '\t' escaped by '\\\\' 
OPTIONALLY ENCLOSED BY '"' lines terminated by '\r\n' IGNORE 1 LINES;

If you accidentally load the data more than once, or run into some other problem, you can rerun these steps after dropping the tables and recreating and loading them as described above.

## Queries
Answer all of the questions below by writing and executing SQL queries. The queries must contain ONLY the answer to the question (no extra rows or columns). You many only use SQL to answer the questions. You may need to explore the database a bit prior to generating your final solutions. You can limit the number of records returned from a query by using the ending term "LIMIT N", where N is the number of records to turn.  

For example, "SELECT * FROM AN_VITALS LIMIT 100;" returns the 100 records from the AN_VITALS table.

### Query 1 

How many patients are male?

In [13]:
%%sql
select count(c.id) Male from an_case c where sex = 'M';

1 rows affected.

[(13,)]

### Query 2

What are the names of the different signals recorded in the vitals table (in alphabetical order)?

In [14]:
%%sql
select distinct v.signalname from an_vitals v order by v.signalname ASC;

3 rows affected.

[('DBP',), ('HR',), ('SBP',)]

### Query 3 

How old was each patient at the time of the operation? (show id and age in years). Sort in order by age from youngest to oldest.

In [16]:
%%sql
select id, timestampdiff(year, c.dob, c.opDate) age from an_case c order by age asc;

20 rows affected.

[(16, 21),
 (10, 23),
 (17, 23),
 (4, 30),
 (1, 31),
 (5, 35),
 (6, 37),
 (13, 37),
 (14, 40),
 (2, 42),
 (12, 45),
 (8, 46),
 (18, 50),
 (19, 50),
 (9, 53),
 (15, 57),
 (11, 60),
 (7, 63),
 (20, 67),
 (3, 70)]

### Query 4

Which patients are either smokers or have allergies? Use a UNION operator in this query. List the relevant patient ids, first and last names in order by last then first name.

In [18]:
%%sql
select co.id, c.firstName, c.lastName from an_comorbid co join an_case c on co.id = c.id where co.descr = 'allergy'
union
select co.id, c.firstName, c.lastName from an_comorbid co join an_case c on co.id = c.id where co.descr = 'Smoker'
order by lastName, firstName;

10 rows affected.

[(2, 'Kayla', 'Baker'),
 (12, 'Teresa', 'Gomez'),
 (9, 'Tomas', 'Hernandez'),
 (20, 'Jose', 'Jones'),
 (4, 'Tyler', 'Little'),
 (3, 'Judy', 'Perez'),
 (14, 'Dante', 'Peterson'),
 (8, 'Christine', 'Walker'),
 (13, 'Sophia', 'Ward'),
 (10, 'David', 'Young')]

### Query 5

Which woman's highest systolic blood pressure was over 170? Show her first and last name.

In [19]:
%%sql
select distinct c.firstName, c.lastName from an_case c join an_vitals v on c.id = v.id 
where c.sex = "F" and v.signalname = 'SBP' and v.value > 170;

1 rows affected.

[('Judy', 'Perez')]

## Query 6

The function TIMESTAMPDIFF(unit,startingDatetime,endingDatetime) can be used to calculate elapsed time in different units. You may use this function to help answer this question.

Which patients who are at least 40 years old at the time of surgery, had a max SBP < 120? 
Show lastname, firstname, max SBP

In [20]:
%%sql
select c. id, c.lastName, c.firstName , max(v.value) MaxSBP
from an_case c 
join an_vitals v on c.id = v.id 
where timestampdiff(YEAR, c.dob, c.opDate) >= 40 and v.signalname = 'SBP'
group by c.id, c.lastName, c.firstName
having max(v.value) < 120;

2 rows affected.

[(14, 'Peterson', 'Dante', 117.0), (20, 'Jones', 'Jose', 105.0)]

### Query 7

What is the average number of comorbidities? (to two decimal places)

In [21]:
%%sql
select round((avg(com)), 2) average from
(select count(descr) com from an_comorbid co group by co.descr) num ;

1 rows affected.

[(Decimal('3.00'),)]

### Query 8

What are the 3 most frequent comorbidity ICD codes? Show the ICD code, description and the number of occurrences.
List in descending order by frequency.

In [23]:
%%sql
select icd, descr, count(icd) NunOfOccur from an_comorbid group by icd, descr order by count(icd) desc limit 3;

3 rows affected.

[('Z72.0', 'Smoker', 5), ('J45.9', 'Asthma', 4), ('Z88.6', 'Allergy', 3)]

### Query 9

What is the eventdescr value for the last event for Patient 3?

In [25]:
%%sql
select id, eventdescr from an_event where id = 3 order by eventtime desc limit 1;

1 rows affected.

[(3, 'Extubation')]

### Query 10

Which patient(s) do not have a "knife to skin" event? List id(s) in numerical order. Do not repeat Ids.

In [29]:
%%sql
select  distinct id from an_event where id
not in (select  distinct id from an_event where eventdescr = 'knife to skin');

2 rows affected.

[(14,), (19,)]

### Query 11

How long was each patients' surgery (in minutes)?
Round to the nearest minute using the SQL ROUND command. List the case id and the number of minutes, in order from shortest to longest, then by id.

In [31]:
%%sql
##//assume patient's surgery time is from the first event to last one.//
select id, round((M - mi)/60) SurTime
from
(select id, max(eventtime) M, min(eventtime) mi
from an_event
group by id) diff
order by round((M - mi)/60) asc, id;

20 rows affected.

[(14, Decimal('46')),
 (18, Decimal('53')),
 (2, Decimal('54')),
 (5, Decimal('61')),
 (15, Decimal('75')),
 (9, Decimal('90')),
 (19, Decimal('90')),
 (12, Decimal('97')),
 (20, Decimal('98')),
 (11, Decimal('117')),
 (7, Decimal('118')),
 (1, Decimal('128')),
 (4, Decimal('129')),
 (8, Decimal('137')),
 (16, Decimal('140')),
 (17, Decimal('140')),
 (10, Decimal('144')),
 (6, Decimal('148')),
 (3, Decimal('195')),
 (13, Decimal('209'))]

### Query 12
Which case had the longest surgical time? (Knife to skin to Surgery / operation over events). Give the case id.

In [32]:
%%sql
select id
from
(select id, max(eventtime) tMax, min(eventtime) tMin from an_event 
where eventdescr like '%knife%' or eventdescr like '%sur%' or eventdescr like '%operation%' or eventdescr like '%over%'
group by id) diff
order by (tMax-tMin) desc
limit 1;

1 rows affected.

[(13,)]

### Query 13
How long was the case? (Knife to skin to Surgery / operation over events). Give the answer in whole minutes.

In [34]:
%%sql
select round((tMax-tMin)/60) SurTime
from
(select id, max(eventtime) tMax, min(eventtime) tMin from an_event 
where eventdescr like '%knife%' or eventdescr like '%sur%' or eventdescr like '%operation%' or eventdescr like '%over%'
group by id) diff
order by (tMax-tMin) desc
limit 1;

1 rows affected.

[(Decimal('158'),)]

### Query 14
The hospital wants to reduce it's inventory. So, it wants to review drugs that are used infrequently.

Find all the named drugs (from the drugs table or from the drug category table) used in less than 2 cases. List the drug name and the number of cases it was used in. Sort by drug name.

In [35]:
%%sql
select drname, count(distinct d.id) cases from an_drug d group by d.drname having count(distinct d.id) < 2
union
select drname, 0 cases from an_drugCategory dc where dc.drname not in
(select distinct d.drname from an_drug d where d.drname = dc.drname)
order by drname;

11 rows affected.

[('Atracurium', 1),
 ('Augmentin', 1),
 ('Bupivicane', 1),
 ('Clonidine', 1),
 ('Halothane', 0),
 ('Lignocaine', 1),
 ('Morphine', 1),
 ('Remifentynal', 1),
 ('Rocuronium', 0),
 ('Tetracaine', 0),
 ('Tranexamic Acid', 1)]

### Query 15
The hospital wants to identify patients who might have complications. 
One way to do this is to use to do this is to use the Surgical Apgar score (http://www.atulgawande.com/documents/AnApgarScoreforSurgery.pdf). 

The score uses estimated blood loss (the EBL column in our case table), the patient's minimum mean blood pressure (they want arterial, but our noninvasive measure will suffice), and lowest heart rate.

|                   | 0 points | 1 point   | 2 points | 3 points | 4 points |
|-------------------|----------|-----------|----------|----------|----------|
| EBL               |  > 1,000 | 601-1,000 |  101-600 |  <= 100  |     -    |
| Lowest Mean BP    |   < 40   |   40-54   |   55-69  |   >=70   |     -    |
| Lowest Heart Rate |   > 85   |   76-85   |   66-75  |   56-65  |   <= 55  |

Mean Blood Pressure = $\frac{SBP + 2 * DBP}{3}$. It weights the diastolic blood pressure twice as much as the systolic. Note that valid (non-artifact) values for DBP are > 20 and SBP > 40.

Show the case id, EBL points, BP points, HR points and the final Surgical Apgar Score for each case. Sort in order by id. 

Your SQL code MUST handle all possible ranges of values.

In [36]:
%%sql
##//It will take long time for excecuting. Thanks for your patience!!
select bp.id, c.ebl EBL,
case when c.ebl >= 1000 then 0
	 when c.ebl >= 601 and c.ebl < 1000 then 1
	 when c.ebl >= 101 and c.ebl < 601 then 2
     when c.ebl < 101 then 3
end EBLpoints,
round(min(bp.MBP),2) MinBP, 
case when min(bp.MBP) < 40 then 0
	 when min(bp.MBP) >= 40 and min(bp.MBP) < 55 then 1
	 when min(bp.MBP) >= 55 and min(bp.MBP) < 70 then 2 
     when min(bp.MBP) >= 70 then 3
end BPpoints, 
	min(h.value) MinHR,
case when min(h.value) >= 85 then 0
	 when min(h.value) >= 76 and min(h.value) < 85 then 1
	 when min(h.value) >= 66 and min(h.value) < 76 then 2 
     when min(h.value) >= 56 and min(h.value) < 66 then 3
     when min(h.value) < 56 then 4
end HRpoints,
(
case when c.ebl >= 1000 then 0
	 when c.ebl >= 601 and c.ebl < 1000 then 1
	 when c.ebl >= 101 and c.ebl < 601 then 2
     when c.ebl < 101 then 3
end+
case when min(bp.MBP) < 40 then 0
	 when min(bp.MBP) >= 40 and min(bp.MBP) < 55 then 1
	 when min(bp.MBP) >= 55 and min(bp.MBP) < 70 then 2 
     when min(bp.MBP) >= 70 then 3
end+
case when min(h.value) >= 85 then 0
	 when min(h.value) >= 76 and min(h.value) < 85 then 1
	 when min(h.value) >= 66 and min(h.value) < 76 then 2 
     when min(h.value) >= 56 and min(h.value) < 66 then 3
     when min(h.value) < 56 then 4
end
) Score
from
(
select s.id, s.signaltime, s.value SBP, d.value DBP, ((s.value+2*d.value)/3) MBP from
(
(select id, signaltime, signalname, value from an_vitals where signalname = 'SBP' and value > 40) s
join
(select id, signaltime, signalname, value from an_vitals where signalname = 'DBP' and value > 20) d
on s.signaltime = d.signaltime and s.id = d.id
)
) bp
join
(select id, signaltime, signalname, value from an_vitals where signalname = 'HR') h
on bp.id = h.id
join
an_case c
on c.id = bp.id
group by bp.id, c.ebl;

20 rows affected.

[(1, 10, 3, 68.33, 2, 83.0, 1, 6),
 (2, 15, 3, 49.67, 1, 69.0, 2, 6),
 (3, 5, 3, 69.33, 2, 50.0, 4, 9),
 (4, 0, 3, 71.67, 3, 45.0, 4, 10),
 (5, 20, 3, 68.67, 2, 47.0, 4, 9),
 (6, 25, 3, 52.33, 1, 50.0, 4, 8),
 (7, 10, 3, 66.89, 2, 60.0, 3, 8),
 (8, 10, 3, 54.68, 1, 47.0, 4, 8),
 (9, 10, 3, 52.83, 1, 55.0, 4, 8),
 (10, 15, 3, 52.08, 1, 43.0, 4, 8),
 (11, 120, 2, 65.83, 2, 49.0, 4, 8),
 (12, 5, 3, 73.96, 3, 51.0, 4, 10),
 (13, 2, 3, 49.67, 1, 37.0, 4, 8),
 (14, 7, 3, 57.0, 2, 48.0, 4, 9),
 (15, 15, 3, 60.67, 2, 65.0, 3, 8),
 (16, 20, 3, 63.33, 2, 48.0, 4, 9),
 (17, 30, 3, 71.33, 3, 55.0, 4, 10),
 (18, 10, 3, 79.0, 3, 60.0, 3, 9),
 (19, 30, 3, 59.0, 2, 44.0, 4, 9),
 (20, 20, 3, 57.33, 2, 37.0, 4, 9)]

## Short answer questions

These questions will be graded based on the thought and effort put into the answers (yes, I know that's a bit vague). Trivial or very minor answers that don't significantly differ from the existing solution will be given minimal points.  Answers should be reasonable approaches, without resorting to overloading fields, etc.

### Short answer 1
Describe another way of structuring the vital sign data within the database. (5 points) 

What the are advantages and disadvantages? (5 points)

Specifically address storage space and how you can access values for more than one signal at any given time point.

(a) I think it's a better way to set up a table that each row includes id, signaltime, HR value, SBP value and DBP         value.

(b) Advantages: We can easily find out 3 signalvalues for each case at a certain time.
    Disadvantages: There'll be some NULL data which would occupy useless storage capacity if each case doesn't have                      all 3 sign values at a certain time.

### Short answer 2
Describe a more compact way to store the BP values. (5 points)

Calculate the savings, based on the following storage requirements:
https://dev.mysql.com/doc/refman/5.7/en/storage-requirements.html#data-types-storage-reqs-numeric
    
You must explain how you got to your space saving answer. (5 points)

Since The BP value can't go out of the range between 0-255, it'll be more compact if the integer type of BP could be TINYINT which has values from 0-255 but only occupies 1 byte. Each cell data in TINYINT type saves 3 bytes comparing with being in INT type.

We have total 8726 data in BP, so we can save 8726 x 3 = 26178 bytes in this case.

### Short answer 3
Some of the event times are negative numbers. 

Why might this be? (3 points)

What are the implications? (4 points)

What might you choose to do about this? (3 points)

(a) I think the negative eventtime means that event is before the predicted surgery time when everything neccessary       for the surgery is set up, including the surgeon, nursing, anesthesia professionals and documents.

(b) That is to say, when the eventtime is positive, it means they can start the surgery anytime. That's why 'LMA           inserted' is always positive.

(c) I think the eventtime type could be changed to 'HHH:MM:SS' which may range from '-838:59:59' to '838:59:59'.
    It's more easy to understand how many hours, minutes or seconds are between events. We can also apply lots of time     function to it. That could be more convenient to find out any kinds of time results we want.

## Survey (5 points)
It took me approximately N hours to complete this assignment, where N is:

N = 25